import in_country from "../assets/in_country.jpg";
import out_country from "../assets/out_country.jpg";
import React from "react";
import "../style/about_contact.css";
function About() {
  return (
    <div className="container_about">
      <h2 className="text_about">About Us</h2>
      <div className="child_who_are">
        <h2 className="text_who_are">តើពួកយើងជានរណា?</h2>
        <h3 className="about_text_who_are">
          នៅ Fast Mart, ពួកយើងជាហាងលក់ទំនិញជិតផ្ទះដែលមានភាពរហ័សរហួន
          និងភាពសម្បូរបែប ដើម្បីបំពេញតម្រូវការប្រចាំថ្ងៃរបស់លោកអ្នក
          ក្នុងតម្លៃសមរម្យ។ ចាប់ពីគ្រឿងប្រើប្រាស់ក្នុងផ្ទះ គ្រឿងទេស សន្លឹកម្ហូប
          ផ្លែឈើ បន្លែ គ្រឿងផឹក រហូតដល់ផលិតផលថែរក្សាខ្លួន —
          ពួកយើងខិតខំផ្តល់ជូនលោកអ្នកនូវ{" "}
          <span className="noted">កន្លែងទិញទំនិញគ្រប់ប្រភេទនៅទីតែមួយ</span>—
          ដែលមានទាំងគុណភាព និងភាពងាយស្រួល។ <br />
          Fast Mart
          ត្រូវបានបង្កើតឡើងដោយមានបេសកកម្មចម្បងក្នុងការធ្វើឲ្យការទិញទំនិញប្រចាំថ្ងៃកាន់តែងាយស្រួល
          និងរហ័សជាងមុន។
          ការពេញចិត្តរបស់អតិថិជនគឺជាចំណុចស្នូលនៃអ្វីៗដែលយើងធ្វើជារៀងរាល់ថ្ងៃ។
          មិនថាអ្នកត្រូវការទិញអីវ៉ាន់បន្តិចបន្តួច កែលម្អផ្ទះបាយ
          ឬសំពះទំនិញប្រចាំថ្ងៃ —{" "}
          <span className="noted">
            ហាងរបស់យើងនៅទីនេះ ដើម្បីបម្រើលោកអ្នកដោយស្នាមញញឹម
          </span>
          ។ អ្វីដែលយើងជឿជាក់៖ <br />
          —ផលិតផលមានគុណភាពក្នុងតម្លៃសមរម្យ
          <br />
          —ផ្គត់ផ្គង់ទំនិញគ្រប់ប្រភេទដែលលោកអ្នកត្រូវការ <br />
          —និងសេវាកម្មរួសរាយរាក់ទាក់ជារៀងរាល់ពេល <br /> Fast Mart មិនមែនជាហាងទេ
          — តែជាផ្នែកមួយនៃជីវិតប្រចាំថ្ងៃរបស់លោកអ្នក។
        </h3>
      </div>
      <div className="child_smart">
        <h2 className="text_smart">ជម្រើសដ៏ឆ្លាតវៃ</h2>
        <h3 className="about_smart">
          Fast Mart ជាហាងលក់ទំនិញទូទៅដែលមានគោលបំណងផ្តល់ជូននូវភាពងាយស្រួល
          និងភាពរហ័សរហួនសម្រាប់ការទិញទំនិញប្រចាំថ្ងៃ។ ពួកយើងផ្តល់ជូននូវ
          ផលិតផលគ្រប់ប្រភេទ ដូចជា៖ អាហារ, គ្រឿងសម្អាង, គ្រឿងប្រើប្រាស់ក្នុងផ្ទះ,
          ផលិតផលសំរាប់ការថែរក្សាសុខភាព និងជាច្រើនទៀត។
          បុគ្គលិករបស់យើងតែងតែស្វាគមន៍អតិថិជនដោយអំណរ
          ហើយមានការផ្តោតលើសេវាកម្មល្អបំផុត។
          <br />
          ផលិតផលដែលមានលក់នៅ Fast Mart មានទាំង
          <br />✅ <span className="noted">ផលិតផលក្នុងស្រុក </span>— គុណភាពល្អ
          តម្លៃសមរម្យ
          <br />✅ <span className="noted">ផលិតផលនាំចូលពីក្រៅស្រុក</span> —
          មានស្តង់ដារអន្តរជាតិ
          <br />
        </h3>
      </div>
      <div className="child_about_produt">
        <img src={in_country} alt="ផលិតផលក្នុងស្រុក" className="product_qty" />
        <img src={out_country} alt="ផលិតផលក្រៅស្រុក"className="product_qty" />
      </div>
      <div className="child_experience">
        <h2 className="text_experience">បទពិសោធន៍របស់យើង</h2>
        <h3 className="about_experience">
          ជាមួយបទពិសោធន៍ជាច្រើនឆ្នាំក្នុងវិស័យលក់រាយ Fast Mart
          បានក្លាយជាហាងដែលមានភាពជឿជាក់
          និងគួរជាទំនុកចិត្តសម្រាប់អតិថិជនក្នុងសហគមន៍។
          ពួកយើងយល់ដឹងពីអ្វីដែលអតិថិជនត្រូវការ — មានភាពងាយស្រួល បម្រើបានលឿន
          និងទំនិញដែលអាចទុកចិត្តបាន។
          ក្រុមការងាររបស់យើងមានបទពិសោធន៍ក្នុងការជ្រើសរើសទំនិញ ដឹកជញ្ជូន
          ថែទាំអតិថិជន និងគ្រប់គ្រងហាង
          ដើម្បីធានាថាការទិញទំនិញរបស់លោកអ្នកមានសុភមង្គល និងរលូន។
          <br />
          <span className="noted">✅ អ្វីដែលបង្ហាញពីបទពិសោធន៍របស់យើង៖</span>
          <br />
          — បម្រើអតិថិជនជាច្រើនឆ្នាំក្នុងទីផ្សារកម្ពុជា
          <br />
          — មានដៃគូផ្គត់ផ្គង់ទំនិញទាំងក្នុងស្រុក និងក្រៅស្រុក
          <br />
          — បុគ្គលិកមានបទពិសោធន៍ និងរួសរាយរាក់ទាក់
          <br />— មានភាពជោគជ័យក្នុងការទទួលបានការពេញចិត្តពីអតិថិជនជានិច្ច
        </h3>
      </div>
      <div className="child_gift">
        <h2 className="text_gift">ទទួលរង្វាន់ជារៀងរាល់ថ្ងៃជាមួយ Fast Mart</h2>
        <h3 className="about_gift">
          នៅ Fast Mart យើងមិនត្រឹមតែផ្តល់ជូនសេវាកម្មល្អទេ — ប៉ុន្តែយើងចង់ឲ្យអ្នក
          ទទួលបានអ្វីបន្ថែមទៀត ក្នុងគ្រប់ការទិញរបស់អ្នក។
          <br />
          អ្វីដែលអ្នកអាចទទួលបាន៖
          <br /> — ទិញចាប់ពី១០ដុល្លាឡើងនឹងទទួលបានពិន្ទុដូរជាលុយបញ្ចុះតម្លៃ
          <br />— បញ្ចុះតម្លៃពិសេសសម្រាប់សមាជិក
          <br />
          ចូលរួមជាសមាជិក Fast Mart Rewards ឥឡូវនេះ ដោយឥតគិតថ្លៃ! <br />
          📲 កម្មវិធី Fast Mart App ក៏មាននៅលើApp store នឹង​ Play store —
          អ្នកអាចតាមដានពិន្ទុ, ទទួលអត្ថប្រយោជន៍
          និងជាព័ត៌មានអំពីព្រឹត្តិការណ៍ពិសេសៗបានក្នុងតែឧបករណ៍មួយ!
        </h3>
      </div>
      <div className="visite_us">
        <h2 className="text_visite">ទីតាំងផ្ទាល់់របស់យើង</h2>
        <h3 className="about_visite">
          Fast Mart មិនមែនជាគោលដៅទំនិញតែតាមអនឡាញប៉ុណ្ណោះទេ —
          យើងស្ថិតនៅទីនេះដើម្បីបម្រើអ្នកផ្ទាល់ផងដែរ!
          សូមមកទស្សនាការិយាល័យកណ្តាលរបស់យើង ឬហាងទាំង ៨
          ទីតាំងនៅទូទាំងប្រទេសកម្ពុជា។
          <br />
          <span className="noted">🏢 អាសយដ្ឋានផ្លូវការ៖</span>
          <br />
          Fast Mart Headquarters <br />
          អាគារលេខ 113C (ជាន់ទី 2), ផ្លូវម៉ាវសេតុង, សង្កាត់ទួលស្វាយព្រៃ,
          ខណ្ឌបឹងកេងកង, រាជធានីភ្នំពេញ, កម្ពុជា 120104 <br />📩 ត្រូវការជំនួយ?
          ទំនាក់ទំនងក្រុមការងារផ្នែកសេវាអតិថិជនរបស់យើងនៅ 📧 info@fastmart.com.kh
          ឬចូលទៅកាន់ មជ្ឈមណ្ឌលជំនួយ (Help Center) ដើម្បីអានសំណួរញឹកញាប់ (FAQs)។
        </h3>
      </div>
    </div>
  );
}

export default About;
